read_verilog circuits/RCA16.v
hierarchy -check -top RCA16
flatten

proc; opt; memory; opt; fsm; opt; techmap; opt

abc -fast -liberty data/LSmitll_v2p1p1/LSmitll_v2p1p1.lib 

clean

write_blif -impltf -gates -icells out/RCA16.blif